Repository: alcf/chms
Catalog: includes/qcodo/i18n/*.po
Languages: es

source: Internationalization and Translation
es: Internacionalización y Traducción

source: Qcodo offers internationalization support via <b>QApplication::Translate()</b> (which internally will use the <b>QI18n</b> class). Language and country settings can be setup in <b>prepend.inc</b>. By default, Qcodo will check the session to determine which language and country is currently being used, but it is really up to the developer to determine how you want the language and country codes get discovered (e.g., via the URL, via GET arguments, etc.)
es: Qcodo ofrece internacionalización apoyo vía <b>QApplication::Translate()</b> (que utilizaró internamente el <b>QI18n</b> La clase). Los escenarios del idioma y el país pueden ser arreglos en el <b>prepend.inc</b>. Por omisión, Qcodo verificaró la sesión para determinar cuál idioma y el país se utilizan actualmente, pero son realmente hasta el revelador para determinar cómo usted quiere que los códigos del idioma y el país obtienen descubierto (por ejemplo, vía el URL, vía OBTIENE los argumentos, etc.)

source: Language files are in the GNU PO format (see
es: Los archivos del idioma están en el formato de GNU PO (ve

source: for more information), and are placed in the <b>/includes/i18n</b> directory.
es: para más información), y son colocados en el <b>/includes/i18n</b> guía.

source: To translate any piece of text, simply use <b>QApplication::Translate(xxx)</b>. Or as a shortcut, if you want to do a PHP <b>print()</b> of any translated text in your template, you can use the qcodo printing shortcut <b>_t(xxx)</b> -- this does the equivalent of <b>print(QApplication::Translate(xxx))</b>.
es: Para traducir cualquier pedazo de texto, simplemente uso <b>QApplication::Translate(xxx)</b>. O cuando un atajo, si usted quiere hacer un PHP <b>print()</b> de algén texto traducido en su plantilla, usted puede utilizar el qcodo que imprime el atajo <b>_t(xxx)</b> -- esto hace el equivalente de <b>print(QApplication::Translate(xxx))</b>.

source: Note that generated Form Drafts and the QControls are all I18n aware -- they will translate themselves based on the selected language (as long as the appropriate language file exists). Qcodo-specific langauge files are part of Qcodo core, and exist in <b>/includes/qcodo/i18n</b>. <b>Please Note:</b> we are desparately in need of more language files. If you are able to contribute, please take the current en.po file and translate it to any currently unsupported language and feel free to submit it. Also note that the Spanish translation (es.po) language files (both in the example and in Qcodo core) need to be corrected.
es: Note que Forma engendrada Redacta y el QControls es todo I18n enterado -- ellos traduciron a sí mismo se basaron en el idioma escogido (tan largo como el archivo apropiado del idioma existe). Los archivos Qcodo-específicos de langauge forman parte del centro de Qcodo, y existen en <b>/includes/qcodo/i18n</b>. <b>Favor de notar:</b> Somos desparately necesitados de más archivos del idioma. Si usted es capaz de contribuir, complacer toma el archivo de en.po de corriente y lo traduce a cualquier idioma actualmente no apoyado y se siente libre someterselo. Note también que la traducción española (es.po) los archivos del idioma (en el ejemplo y en el centro de Qcodo) la necesidad de ser corregida.

source: Finally, due to the heavy processing of PO parsing, the results of the PO parsing are cached using QCache, and cached files are stored in <b>/includes/cache/i18n</b>.
es: Finalmente, debido al procesamiento pesado de analizar sintácticamente de PO, los resultados del analizar sintácticamente de PO se guardan utilizar QCache, y los archivos guardados se almacenan en <b>/includes/cache/i18n</b>.

source: Internationalization Example
es: Ejemplo de Internacionalización

source: Current Language
es: Idioma Actual

source: Switch to
es: Cambie a

source: To view the People form draft translated into the selected language, go to
es: Para ver el "Form Draft" de las Personas tradujo al idioma escogido, va a
